Repository: rollerworks/PasswordStrengthValidator
Catalog: src/Resources/translations/validators.*.xlf
Languages: cs, fr, nl, ru, sk

source: Your password must be at least {{length}} characters long.
cs: Heslo musí mít alespoň {{length}} znaků.
fr: Le mot de passe doit faire au moins {{length}} caractères.
nl: Wachtwoord moet minstens {{length}} tekens lang zijn.
ru: Длина пароля должна быть не менее {{length}} символов.
sk: Heslo musí obsahovať aspoň {{length}} znakov.

source: Your password must include at least one letter.
cs: Heslo musí obsahovat písmeno.
fr: Le mot de passe doit contenir au moins une lettre.
nl: Wachtwoord moet ten minste één letter bevatten.
ru: Пароль должен содержать, по крайней мере, одну букву.
sk: Heslo musí obsahovať písmeno.

source: Your password must include both upper and lower case letters.
cs: Heslo musí obsahovat velká i malá písmena.
fr: Le mot de passe doit contenir des majuscules et des minuscules.
nl: Wachtwoord moet ten minste één hoofdletter en kleine letter bevatten.
ru: Пароль должен содержать как прописные, так и строчные буквы.
sk: Heslo musí obsahovať veľké aj malé písmená.

source: Your password must include at least one number.
cs: Heslo musí obsahovat číslici.
fr: Le mot de passe doit contenir au moins un chiffre.
nl: Wachtwoord moet ten minste één nummer bevatten.
ru: Пароль должен содержать, по крайней мере, одну цифру.
sk: Heslo musí obsahovať číslicu.

source: Your password must contain at least one special character.
cs: Heslo musí obsahovat speciální znak.
fr: Le mot de passe doit contenir au moins un caractère spécial.
nl: Wachtwoord moet ten minste één speciaal teken of leesteken bevatten.
ru: Пароль должен содержать, по крайней мере, один специальный символ.
sk: Heslo musí obsahovať špeciálny znak.

source: password_too_weak
cs: Úroveň hesla musí být alespoň "{{ min_strength }}", současná úroveň je "{{ current_strength }}", zkuste {{ strength_tips }}.
fr: Le mot de passe doit avoir une force d'au moins "{{ min_strength }}", la force actuelle est "{{ current_strength }}", essayez ceci : {{ strength_tips }}.
nl: Wachtwoord moet ten minste aan veiligheidsniveau "{{ min_strength }}" voldoen, maar het huidige niveau is "{{ current_strength }}". Probeer het volgende: {{ strength_tips }}.
ru: Пароль должен быть как минимум "{{ min_strength }}" уровня сложности, текущий уровень сложности "{{ current_strength }}", обратите внимание на эти советы: {{ strength_tips }}.
sk: Úroveň hesla musí být aspoň "{{ min_strength }}", súčasná úroveň je "{{ current_strength }}", skúste {{ strength_tips }}.

source: rollerworks_password.strength_level.very_weak
cs: velmi slabé
fr: Très faible
nl: Erg zwak
ru: Очень слабый
sk: veľmi slabé

source: rollerworks_password.strength_level.weak
cs: slabé
fr: Faible
nl: Zwak
ru: Слабый
sk: slabé

source: rollerworks_password.strength_level.medium
cs: střední
fr: Moyenne
nl: Gemiddeld
ru: Средний
sk: priemerné

source: rollerworks_password.strength_level.strong
cs: silné
fr: Forte
nl: Sterk
ru: Сильный
sk: silné

source: rollerworks_password.strength_level.very_strong
cs: velmi silné
fr: Très forte
nl: Zeer sterk
ru: Очень сильный
sk: veľmi silné

source: rollerworks_password.tip.letters
cs: přidat malá/velká písmena
fr: ajouter des lettres (majuscules/minuscules)
nl: voeg (hoofd/kleine) letters toe
ru: добавить буквы (прописные / строчные)
sk: pridať malé/veľké písmená

source: rollerworks_password.tip.numbers
cs: přidat číslici
fr: ajouter des chiffres
nl: voeg cijfers toe
ru: добавить цифры
sk: pridať číslicu

source: rollerworks_password.tip.lowercase_letters
cs: přidat malé písmeno
fr: ajouter des minuscules
nl: voeg kleine letters toe
ru: добавить строчные буквы
sk: pridať malé písmeno

source: rollerworks_password.tip.uppercase_letters
cs: přidat velké písmeno
fr: ajouter des majuscules
nl: voeg hoofdletters toe
ru: добавить заглавные буквы
sk: pridať veľké písmeno

source: rollerworks_password.tip.special_chars
cs: přidat speciální znak
fr: ajouter des caractères spéciaux
nl: voeg speciale tekens of leestekens toe
ru: добавить специальные символы
sk: pridať špeciálny znak

source: rollerworks_password.tip.length
cs: delší heslo
fr: ajouter plus de caractères
nl: gebruik meer tekens
ru: добавить больше символов
sk: dlhšie heslo

source: This password was found in a database of compromised passwords. It has been used {{ used }} times. For security purposes you must use something else.
cs: Toto heslo bylo nalezeno v databázi ohrožených hesel. Bylo použito {{used}} krát. Z bezpečnostních důvodů musíte použít jiné heslo.
fr: Ce mot de passe a été trouvé dans une base de données de mots de passe erronés. Il a été utilisé {{ used }} fois. Pour des raisons de sécurité, veuillez choisir un autre mot de passe.
nl: Het wachtwoord is gevonden in een database van gelekte wachtwoorden. Het is {{ used }} keer gebruikt. Uit veiligheidsoverwegingen dient u een ander wachtwoord te kiezen.
ru: Этот пароль был найден в базе данных с взломанными паролями. Он использовался {{used}} раз. В целях безопасности вы должны использовать что-то еще.
sk: Toto heslo bolo nájdené v databázi ohrozených hesiel. Bolo použité {{used}} krát. Z bezpečnostných dôvodov musíte použiť iné heslo.
